<a href="https://colab.research.google.com/github/Ghalia671/MODULE1/blob/master/Kezhan_1_3_Variables_temporelles.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Données

In [ ]:
import datetime
import numpy as np
import pandas as pd
from dateutil.parser import parse
import pytz

In [ ]:
dates=["30/04/2005","23/05/2010","04/09/2009"]
dates=pd.DataFrame(dates, columns=['date'])

In [ ]:
dates

         date
0  30/04/2005
1  23/05/2010
2  04/09/2009

In [ ]:
dates_heures = np.array([
    '32-04-2005 11:35 PM',
    '23-05-2010 12:01 AM',
    '04-09-2009 09:09 PM'
])
dates_heures = pd.DataFrame(dates_heures, columns=['date_heure'])

In [ ]:
dates_heures

            date_heure
0  32-04-2005 11:35 PM
1  23-05-2010 12:01 AM
2  04-09-2009 09:09 PM

In [ ]:
time_stamps = ['2015-03-08 10:30:00.360000+00:00', '2017-07-13 15:45:05.755000-07:00',
               '2012-01-20 22:30:00.254000+05:30', '2016-12-25 00:30:00.000000+10:00']
time_stamps = pd.DataFrame(time_stamps, columns=['Time'])
time_stamps

                               Time
0  2015-03-08 10:30:00.360000+00:00
1  2017-07-13 15:45:05.755000-07:00
2  2012-01-20 22:30:00.254000+05:30
3  2016-12-25 00:30:00.000000+10:00

# Conversion en variables temporelles

In [ ]:
dates["date_t"]=pd.to_datetime(dates["date"], format='%d/%m/%Y')

In [ ]:
dates

         date     date_t
0  30/04/2005 2005-04-30
1  23/05/2010 2010-05-23
2  04/09/2009 2009-09-04

In [ ]:
dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   date_t  3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 176.0+ bytes

In [ ]:
dates_heures

            date_heure
0  32-04-2005 11:35 PM
1  23-05-2010 12:01 AM
2  04-09-2009 09:09 PM

In [ ]:
dates_heures.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date_heure  3 non-null      object
dtypes: object(1)
memory usage: 152.0+ bytes

In [ ]:
pd.to_datetime(dates_heures["date_heure"], format='%d-%m-%Y %I:%M %p',errors='coerce')

0                   NaT
1   2010-05-23 00:01:00
2   2009-09-04 21:09:00
Name: date_heure, dtype: datetime64[ns]

In [ ]:
time_stamps["time_t"]=pd.to_datetime(time_stamps["Time"],utc=True)

In [ ]:
time_stamps

                               Time                           time_t
0  2015-03-08 10:30:00.360000+00:00 2015-03-08 10:30:00.360000+00:00
1  2017-07-13 15:45:05.755000-07:00 2017-07-13 22:45:05.755000+00:00
2  2012-01-20 22:30:00.254000+05:30 2012-01-20 17:00:00.254000+00:00
3  2016-12-25 00:30:00.000000+10:00        2016-12-24 14:30:00+00:00

## Fuseaux horaires

In [ ]:
import pandas as pd

pd.Timestamp('2017-05-01 06:00:00', tz='Europe/London')

In [ ]:
date = pd.Timestamp('2017-05-01 06:00:00')

date_in_london = date.tz_localize('Europe/London')

date_in_london

In [ ]:
date_in_london.tz_convert('Africa/Abidjan')

In [ ]:
dates_sim = pd.Series(pd.date_range('2/2/2002', periods=3, freq='M'))

dates_sim.dt.tz_localize('Africa/Abidjan')

# Variables temporelles calculées

## Elements sous-jacents

In [ ]:
dates

dates['year'] = dates['date_t'].dt.year
dates['month'] = dates['date_t'].dt.month
dates['day'] = dates['date_t'].dt.day
dates['hour'] = dates['date_t'].dt.hour
dates['minute'] = dates['date_t'].dt.minute

dates['dayofweek'] = dates['date_t'].dt.dayofweek
dates['weekday'] = dates['date_t'].dt.weekday
dates['dayofyear'] = dates['date_t'].dt.dayofyear
dates['weekofyear'] = dates['date_t'].dt.weekofyear
dates['quarter'] = dates['date_t'].dt.quarter

In [ ]:
dates

         date     date_t  year  month  ...  weekday  dayofyear  weekofyear  quarter
0  30/04/2005 2005-04-30  2005      4  ...        5        120          17        2
1  23/05/2010 2010-05-23  2010      5  ...        6        143          20        2
2  04/09/2009 2009-09-04  2009      9  ...        4        247          36        3

[3 rows x 12 columns]

In [ ]:
time_stamps

                               Time                           time_t
0  2015-03-08 10:30:00.360000+00:00 2015-03-08 10:30:00.360000+00:00
1  2017-07-13 15:45:05.755000-07:00 2017-07-13 22:45:05.755000+00:00
2  2012-01-20 22:30:00.254000+05:30 2012-01-20 17:00:00.254000+00:00
3  2016-12-25 00:30:00.000000+10:00        2016-12-24 14:30:00+00:00

In [ ]:
time_stamps["hour"]=time_stamps["time_t"].dt.hour
time_stamps["minute"]=time_stamps["time_t"].dt.minute
time_stamps["second"]=time_stamps["time_t"].dt.second
time_stamps["microsecond"]=time_stamps["time_t"].dt.microsecond

In [ ]:
time_stamps

## Elements avancés

In [ ]:
hour_bins = [-1, 5, 11, 16, 21, 23]
bin_names = ['Minuit', 'Matin', 'Après-midi', 'Soir', 'Nuit']

time_stamps['TimeOfDayBin'] = pd.cut(time_stamps['hour'], 
                            bins=hour_bins, labels=bin_names)
time_stamps[['Time', 'hour', 'TimeOfDayBin']]

                               Time  hour TimeOfDayBin
0  2015-03-08 10:30:00.360000+00:00    10        Matin
1  2017-07-13 15:45:05.755000-07:00    22         Nuit
2  2012-01-20 22:30:00.254000+05:30    17         Soir
3  2016-12-25 00:30:00.000000+10:00    14   Après-midi

## Diffrence entre deux dates

In [ ]:
import pandas as pd # Create data frame
dataframe = pd.DataFrame()
    # Create two datetime features
dataframe['Arrived'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-04-2017')]

dataframe['Left'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-06-2017')]

dataframe['Left'] - dataframe['Arrived']

## Moyenne glissant

In [ ]:
import pandas as pd

time_index = pd.date_range('01/01/2010', periods=5, freq='M')
df = pd.DataFrame(index=time_index)
df['Stock_Price'] = [1,2,3,4,5]
df.rolling(window=2).mean()

# Gestion des données manquantes

In [ ]:
import pandas as pd
import numpy as np

time_index = pd.date_range('01/01/2010', periods=5, freq='M')

df = pd.DataFrame(index=time_index)

df["Sales"] = [1.0, 2.0, np.nan, np.nan, 5.0]

df.interpolate()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    4.0
2010-05-31    5.0

In [ ]:
df.ffill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    2.0
2010-04-30    2.0
2010-05-31    5.0

In [ ]:
df.bfill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    5.0
2010-04-30    5.0
2010-05-31    5.0

In [ ]:
df.interpolate(limit=1, limit_direction="forward")

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    NaN
2010-05-31    5.0